Vulnerability Test Results/artillery-load-test.yml
config:
  target: 'https://wcoipyffkhhvcpknrqpb.supabase.co'
  phases:
    - duration: 60
      arrivalRate: 20
      rampTo: 100
      name: 'Baseline 100 VU Load Test'
  defaults:
    headers:
      apikey: 'sb_publishable_dE6gJYL2yGgxS9lIEKoqHA_FDooPDHg'
      Authorization: 'Bearer sb_publishable_dE6gJYL2yGgxS9lIEKoqHA_FDooPDHg'
      Content-Type: 'application/json'

scenarios:
  - name: 'VitalMatch API Endpoint Load Test'
    flow:
      - get:
          url: '/rest/v1/profiles?select=*&is_donor=eq.true'
      - get:
          url: '/rest/v1/emergency_requests?select=*&status=eq.Active'
